Revit.AnalysisDisplay.PointAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IEnumerable{System.Double})
Create a Point Analysis Display in the current view
view:
sampleLocations:
samples:

Revit.AnalysisDisplay.PointAnalysisDisplay.InternalSetSpatialFieldValues(System.Collections.Generic.IEnumerable{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IEnumerable{System.Double})
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
pointLocations:
values:

Revit.AnalysisDisplay.PointAnalysisDisplay.ByViewPointsAndValues(Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point[],System.Double[])
Show a colored Point Analysis Display in the Revit view
view:
samplePoints:
samples:
Returns: